tap "daviderestivo/emacs-head"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "makeworld-the-better-one/tap"
tap "smlsharp/smlsharp"
brew "amfora"
brew "autoconf"
brew "fontconfig"
brew "python@3.9"
brew "libx11"
brew "gmp"
brew "guile"
brew "gnutls"
brew "jansson"
brew "cask"
brew "clang-format"
brew "clib"
brew "cmake"
brew "cmigemo"
brew "cowsay"
brew "cunit"
brew "cutter"
brew "deno"
brew "doxygen"
brew "figlet"
brew "fzf"
brew "gauche"
brew "gcc"
brew "ghq"
brew "git"
brew "graphviz"
brew "htop"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "libgccjit"
brew "llvm"
brew "llvm@11"
brew "mosh"
brew "nasm"
brew "tree-sitter"
brew "node"
brew "postgresql"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "rust-analyzer"
brew "sphinx-doc"
brew "stow"
brew "terminal-notifier"
brew "texinfo", link: true
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "zlib"
brew "daviderestivo/emacs-head/emacs-head@29", args: ["with-cocoa", "with-dbus", "with-native-comp", "with-native-full-aot"]
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "clipy"
cask "emacs"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "mactex"
cask "visual-studio-code"
cask "zulu"
